testsuite/sysbench/results/select_random_ranges.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 28055.99 qps: 28055.99 (r/w/o: 28055.99/0.00/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 28329.80 qps: 28329.80 (r/w/o: 28329.80/0.00/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 28337.13 qps: 28337.13 (r/w/o: 28337.13/0.00/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1701643
        write:                           0
        other:                           0
        total:                           1701643
    transactions:                        1701643 (28355.76 per sec.)
    queries:                             1701643 (28355.76 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      28355.7582
    time elapsed:                        60.0106s
    total number of events:              1701643

Latency (ms):
         min:                                    0.38
         avg:                                    2.25
         max:                                  105.52
         95th percentile:                       12.08
         sum:                              3836955.77

Threads fairness:
    events (avg/stddev):           26587.2812/565.44
    execution time (avg/stddev):   59.9524/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 27694.10 qps: 27694.10 (r/w/o: 27694.10/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 27692.17 qps: 27692.17 (r/w/o: 27692.17/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 27721.53 qps: 27721.53 (r/w/o: 27721.53/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1663027
        write:                           0
        other:                           0
        total:                           1663027
    transactions:                        1663027 (27711.75 per sec.)
    queries:                             1663027 (27711.75 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      27711.7539
    time elapsed:                        60.0118s
    total number of events:              1663027

Latency (ms):
         min:                                    0.44
         avg:                                    2.31
         max:                                    6.82
         95th percentile:                        2.61
         sum:                              3835489.37

Threads fairness:
    events (avg/stddev):           25983.8125/259.88
    execution time (avg/stddev):   59.9295/0.00